trule-star/xiaozhi-esp32/main/boards/trulestar-p4c5-photos/tsp4c5_aiphotos_board.c
#if CONFIG_BSP_LCD_USE_DMA2D && (ESP_IDF_VERSION < ESP_IDF_VERSION_VAL(6, 0, 0))
    for (int i = 0; i < sizeof(dpi_configs) / sizeof(dpi_configs[0]); i++) {
        dpi_configs[i].flags.use_dma2d = true;
    }
#endif

    const esp_lcd_panel_lt8912b_video_timing_t video_timings[] = {
        ESP_LCD_LT8912B_VIDEO_TIMING_800x600_60Hz(),
        ESP_LCD_LT8912B_VIDEO_TIMING_1024x768_60Hz(),
        ESP_LCD_LT8912B_VIDEO_TIMING_1280x720_60Hz(),
        ESP_LCD_LT8912B_VIDEO_TIMING_1280x800_60Hz(),
        ESP_LCD_LT8912B_VIDEO_TIMING_1920x1080_30Hz()
    };
    lt8912b_vendor_config_t vendor_config = {
        .mipi_config = {
            .dsi_bus = mipi_dsi_bus,
            .lane_num = BSP_LCD_MIPI_DSI_LANE_NUM,
        },
    };

    /* DPI config */
    switch (config->hdmi_resolution) {
    case BSP_HDMI_RES_800x600:
        ESP_LOGI(TAG, "HDMI configuration for 800x600@60HZ");
        vendor_config.mipi_config.dpi_config = &dpi_configs[0];
        memcpy(&vendor_config.video_timing, &video_timings[0], sizeof(esp_lcd_panel_lt8912b_video_timing_t));
        break;
    case BSP_HDMI_RES_1024x768:
        ESP_LOGI(TAG, "HDMI configuration for 1024x768@60HZ");
        vendor_config.mipi_config.dpi_config = &dpi_configs[1];
        memcpy(&vendor_config.video_timing, &video_timings[1], sizeof(esp_lcd_panel_lt8912b_video_timing_t));
        break;
    case BSP_HDMI_RES_1280x720:
        ESP_LOGI(TAG, "HDMI configuration for 1280x720@60HZ");
        vendor_config.mipi_config.dpi_config = &dpi_configs[2];
        memcpy(&vendor_config.video_timing, &video_timings[2], sizeof(esp_lcd_panel_lt8912b_video_timing_t));
        break;
    case BSP_HDMI_RES_1280x800:
        ESP_LOGI(TAG, "HDMI configuration for 1280x800@60HZ");
        vendor_config.mipi_config.dpi_config = &dpi_configs[3];
        memcpy(&vendor_config.video_timing, &video_timings[3], sizeof(esp_lcd_panel_lt8912b_video_timing_t));
        break;
    case BSP_HDMI_RES_1920x1080:
        ESP_LOGI(TAG, "HDMI configuration for 1920x1080@30HZ");
        vendor_config.mipi_config.dpi_config = &dpi_configs[4];
        memcpy(&vendor_config.video_timing, &video_timings[4], sizeof(esp_lcd_panel_lt8912b_video_timing_t));
        break;
    default:
        ESP_LOGE(TAG, "Unsupported display type (%d)", config->hdmi_resolution);
    }

    const esp_lcd_panel_dev_config_t panel_config = {
        .bits_per_pixel = 24,
        .rgb_ele_order = BSP_LCD_COLOR_SPACE,
        .reset_gpio_num = BSP_LCD_RST,
        .vendor_config = &vendor_config,
    };
    const esp_lcd_panel_lt8912b_io_t io_all = {
        .main = mipi_dbi_io,
        .cec_dsi = io_cec_dsi,
        .avi = io_avi,
    };
    ESP_ERROR_CHECK(esp_lcd_new_panel_lt8912b(&io_all, &panel_config, &disp_panel));

#if CONFIG_BSP_LCD_USE_DMA2D && (ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(6, 0, 0))
    ESP_GOTO_ON_ERROR(esp_lcd_dpi_panel_enable_dma2d(disp_panel), err, TAG, "LCD panel enable DMA2D failed");
#endif

    ESP_GOTO_ON_ERROR(esp_lcd_panel_reset(disp_panel), err, TAG, "LCD panel reset failed");
    ESP_GOTO_ON_ERROR(esp_lcd_panel_init(disp_panel), err, TAG, "LCD panel init failed");

#endif //CONFIG_BSP_LCD_TYPE_

    /* Return all handles */
    ret_handles->io = mipi_dbi_io;
    disp_handles.io = mipi_dbi_io;
#if CONFIG_BSP_LCD_TYPE_HDMI
    ret_handles->io_cec = io_cec_dsi;
    disp_handles.io_cec = io_cec_dsi;
    ret_handles->io_avi = io_avi;
    disp_handles.io_avi = io_avi;
#endif
    ret_handles->mipi_dsi_bus = mipi_dsi_bus;
    disp_handles.mipi_dsi_bus = mipi_dsi_bus;
    ret_handles->panel = disp_panel;
    disp_handles.panel = disp_panel;
    ret_handles->control = NULL;
    disp_handles.control = NULL;

    ESP_LOGI(TAG, "Display initialized");

    return ret;

err:
    bsp_display_delete();
    return ret;
}

void bsp_display_delete(void)
{
    if (disp_handles.panel) {
        esp_lcd_panel_del(disp_handles.panel);
        disp_handles.panel = NULL;
    }
    if (disp_handles.io) {
        esp_lcd_panel_io_del(disp_handles.io);
        disp_handles.io = NULL;
    }
#if CONFIG_BSP_LCD_TYPE_HDMI
    if (disp_handles.io_cec) {
        esp_lcd_panel_io_del(disp_handles.io_cec);
        disp_handles.io_cec = NULL;
    }
    if (disp_handles.io_avi) {
        esp_lcd_panel_io_del(disp_handles.io_avi);
        disp_handles.io_avi = NULL;
    }
#endif
    if (disp_handles.mipi_dsi_bus) {
        esp_lcd_del_dsi_bus(disp_handles.mipi_dsi_bus);
        disp_handles.mipi_dsi_bus = NULL;
    }

    if (disp_phy_pwr_chan) {
        esp_ldo_release_channel(disp_phy_pwr_chan);
        disp_phy_pwr_chan = NULL;
    }

    bsp_display_brightness_deinit();
}

#if !CONFIG_BSP_LCD_TYPE_HDMI
esp_err_t bsp_touch_new(const bsp_touch_config_t *config, esp_lcd_touch_handle_t *ret_touch)
{
    /* Initilize I2C */
    BSP_ERROR_CHECK_RETURN_ERR(bsp_i2c_init());

    /* Initialize touch */
    const esp_lcd_touch_config_t tp_cfg = {
        .x_max = BSP_LCD_H_RES,
        .y_max = BSP_LCD_V_RES,
        .rst_gpio_num = BSP_LCD_TOUCH_RST, // Shared with LCD reset
        .int_gpio_num = BSP_LCD_TOUCH_INT,
        .levels = {
            .reset = 0,
            .interrupt = 0,
        },
        .flags = {
            .swap_xy = 0,
            .mirror_x = 1,
            .mirror_y = 1,
        },
    };
#if CONFIG_BSP_LCD_TYPE_800_1280
    /* JD9366 触摸初始化 */
    esp_lcd_panel_io_i2c_config_t tp_io_config = ESP_LCD_TOUCH_IO_I2C_JD9366_CONFIG();
    tp_io_config.scl_speed_hz = CONFIG_BSP_I2C_CLK_SPEED_HZ;
    ESP_RETURN_ON_ERROR(esp_lcd_new_panel_io_i2c(i2c_handle, &tp_io_config, &tp_io_handle), TAG, "");
    return esp_lcd_touch_new_i2c_jd9366(tp_io_handle, &tp_cfg, ret_touch);
#else
    /* GT911 触摸初始化 */
    esp_lcd_panel_io_i2c_config_t tp_io_config = ESP_LCD_TOUCH_IO_I2C_GT911_CONFIG();
    tp_io_config.scl_speed_hz = CONFIG_BSP_I2C_CLK_SPEED_HZ;
    ESP_RETURN_ON_ERROR(esp_lcd_new_panel_io_i2c(i2c_handle, &tp_io_config, &tp_io_handle), TAG, "");
    return esp_lcd_touch_new_i2c_gt911(tp_io_handle, &tp_cfg, ret_touch);
#endif

